Tekla Open API Reference for Tekla Structures 2025
Shell Methods
The Shell type exposes the following members.
Methods
Name | Description
GetEdgeEnumerator
 Returns a new edge enumerator in the current plane.
GetFaceEnumerator
 Returns a new face enumerator in the current plane.
Top
See Also
Reference
Shell Class
Tekla.Structures.Solid Namespace